<?php
// +----------------------------------------------------------------------
// | 5ucms.com
// +----------------------------------------------------------------------
// | Copyright (c) 2015-9999 http://www.5ucms.com All rights reserved.
// +----------------------------------------------------------------------
// | Author:邱嵩松 QQ 3876307
// +----------------------------------------------------------------------
 
return array( 
	//连接数据库
    'DB_TYPE'   => 'mysql', // 数据库类型
    'DB_HOST'   => 'localhost', // 服务器地址
    'DB_NAME'   => 'test', // 数据库名
    'DB_USER'   => 'root', // 用户名
    'DB_PWD'    => 'root',  // 密码
    'DB_PORT'   => '3306', // 端口
    'DB_PREFIX' => '5u_', // 数据库表前缀   
 
    'DB_FIELDTYPE_CHECK'    =>  false,       // 是否进行字段类型检查
    //以下字段缓存没有其作用
    //① 如果是调试模式就不起作用
    //② false  也是不起作用
    'DB_FIELDS_CACHE'       =>  true,        // 启用字段缓存
    'DB_CHARSET'            =>  'utf8',      // 数据库编码默认采用utf8 
);
